Конфигурация отчетов/DataProcessors/СписокАктивныхПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СписокАктивныхПользователей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ИтогСписокСоединений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Компьютер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Соединение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/СписокАктивныхПользователей/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПолучениеСпискаАктивныхПользователей()
    
    Объект.ИтогСписокСоединений.Очистить();          
    СоединенияИнформационнойБазы = ПолучитьСоединенияИнформационнойБазы();
    ИтогСписокСоединений = Объект.ИтогСписокСоединений;
    Для Каждого Соединение Из СоединенияИнформационнойБазы Цикл                   
		Если Соединение.Пользователь.Имя <> "" ТОгда
			ТЗ=ИтогСписокСоединений.Добавить();                                       
			ТЗ.Пользователь=Соединение.Пользователь.Имя;                              
			ТЗ.Приложение=ПредставлениеПриложения(Соединение.ИмяПриложения);          
			ТЗ.НачалоРаботы=Соединение.НачалоСеанса;                                  
			ТЗ.Компьютер=Соединение.ИмяКомпьютера;                                    
			ТЗ.Соединение=Соединение.НомерСоединения; 
		КонецЕсли;
    КонецЦикла;
    
    нНомерТекущегоСоединения=НомерСоединенияИнформационнойБазы();
    //В итоге получаем ТЗ со списком пользователей и Номер Текущего Соединения 
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПолучениеСпискаАктивныхПользователей();
КонецПроцедуры
